In [1]:
import pandas as pd
pd.Series([7, 3, 5, 8])

0    7
1    3
2    5
3    8
dtype: int64

In [2]:
x = pd.Series([7, 3, 5, 8], index=['서울', '대구', '부산', '광주'])
print(x)
x['서울']

서울    7
대구    3
부산    5
광주    8
dtype: int64

7

In [3]:
x[['서울', '대구']]

서울    7
대구    3
dtype: int64

In [5]:
type(x)

pandas.core.series.Series

In [6]:
x.index

Index(['서울', '대구', '부산', '광주'], dtype='object')

In [7]:
x.values

array([7, 3, 5, 8], dtype=int64)

In [9]:
print(sorted(x.index))
print(sorted(x.values))

['광주', '대구', '부산', '서울']
[3, 5, 7, 8]

In [11]:
x.reindex(sorted(x.index))
x

서울    7
대구    3
부산    5
광주    8
dtype: int64

In [14]:
x = pd.Series([3, 8, 5, 9], index=['서울', '대구', '부산', '광주'])
y = pd.Series([2, 4, 5, 1], index=['대구', '부산', '서울', '대전'])
x+y

광주     NaN
대구    10.0
대전     NaN
부산     9.0
서울     8.0
dtype: float64

In [16]:
medal = [1, 3, 2, 4, 2, 3]
x = pd.Series(medal)
print(pd.unique(x))

[1 3 2 4]

In [17]:
medal = ['민준', '현우', '서연', '동현', '서연', '현우']
x = pd.Series(medal)
print(pd.unique(x))

['민준' '현우' '서연' '동현']

In [20]:
data = {'age' : [23, 43, 12, 45],
        'name' : ['민준', '현우', '서연', '동현'],
        'height' : [175.3, 180.3, 165.8, 172.7]}
x = pd.DataFrame(data, columns = ['name', 'age', 'height'])
x

  name  age  height
0   민준   23   175.3
1   현우   43   180.3
2   서연   12   165.8
3   동현   45   172.7

In [21]:
x.name

0    민준
1    현우
2    서연
3    동현
Name: name, dtype: object

In [22]:
b = {'홍' : 3, '김' : 2, '이' : 5}

In [28]:
ary = [[1,2], [3,4], [5,6]]
data = pd.DataFrame(ary, columns=['First', 'Second'])
data

   First  Second
0      1       2
1      3       4
2      5       6

In [29]:
data.iloc[1]

First     3
Second    4
Name: 1, dtype: int64

In [30]:
data.iloc[:,-1]

0    2
1    4
2    6
Name: Second, dtype: int64

In [31]:
ary = [[1,2], [3,4], [5,6]]
data = pd.DataFrame(ary, columns=['First', 'Second'])
data.head(3)

   First  Second
0      1       2
1      3       4
2      5       6

In [32]:
data.tail(3)

   First  Second
0      1       2
1      3       4
2      5       6

In [34]:
ary = [[1,2], [3,4], [5,6], [7,8], [9,10]]
data = pd.DataFrame(ary, columns=['First', 'Second'])
bools = [False, True, True, False, True]
data.Second[bools]

1     4
2     6
4    10
Name: Second, dtype: int64

In [35]:
print(x.mean(axis=0))

age        30.750
height    173.525
dtype: float64

In [37]:
data = {'age' : [47, 47, 22, 16],
        'name' : ['아빠', '엄마', '채희', '남동생'],
        'height' : [175.3, 164.3, 168.5, 178.7]}
x = pd.DataFrame(data, columns = ['name', 'age', 'height'])
x

  name  age  height
0   아빠   47   175.3
1   엄마   47   164.3
2   채희   22   168.5
3  남동생   16   178.7

In [44]:
x.name

0     아빠
1     엄마
2     채희
3    남동생
Name: name, dtype: object

In [45]:
x.age

0    47
1    47
2    22
3    16
Name: age, dtype: int64

In [66]:
x.height

0    175.3
1    164.3
2    168.5
3    178.7
Name: height, dtype: float64

In [68]:
x.iloc[0]

name         아빠
age          47
height    175.3
Name: 0, dtype: object

In [65]:
x.iloc[2,1]

22

In [57]:
print(x.mean(axis=0))

age        33.0
height    171.7
dtype: float64

In [58]:
data = {'age' : [47, 47, 22, 16],
        'name' : ['아빠', '엄마', '채희', '남동생'],
        'height' : [175.3, 164.3, 168.5, 178.7]}
x = pd.DataFrame(data, columns = ['name', 'age', 'height'])
index = [True, False, True, False]
print(x[index])

  name  age  height
0   아빠   47   175.3
2   채희   22   168.5